[
  {
    "id": "1",
    "name": "Dr. Fred Wantante Setttuba-Male",
    "title": "Senior Pastor, Makerere Full Gospel Church",
    "quote": "Beyond Church Walls presents Bible-based tools to integrate work and worship with a mission mindset in the 21st century. It is laced with testimonies of Christian workers in the trenches of real-life situations, inspiring scholars, practitioners, and ordinary believers alike to live out their faith in the workplace. This book is a must-read for anyone studying or interested in spirituality in the workplace.",
    "type": "pastoral",
    "approved": true,
    "createdAt": "2025-11-21T22:58:26.312Z"
  },
  {
    "id": "2",
    "name": "Dr. Joseph Serwadda",
    "title": "Presiding Apostle of the Born-Again Faith, Uganda",
    "quote": "Beyond Church Walls is a powerful call to live out faith with authenticity and purpose. Blending spiritual insight with practical wisdom, it challenges believers to move beyond the pews and bring Christ's love to life through service and godly influence. A must-read for those ready to make faith a daily reality.",
    "type": "pastoral",
    "approved": true,
    "createdAt": "2025-11-21T22:58:26.312Z"
  },
  {
    "id": "3",
    "name": "Rev. Peter Kasirivu",
    "title": "Founder and Team Leader, Gaba Community Church & Africa Renewal Ministries",
    "quote": "Rev. Kasirye is a prophetic voice in the marketplace, revealing how God has guided his professional and spiritual journey. His book testifies to a life of integrity, vision, and obedience lived across cultures. With depth and authenticity, it shows how faith thrives amid modern pressures. An inspiring work that offers hope, strength, and purpose against all odds.",
    "type": "pastoral",
    "approved": true,
    "createdAt": "2025-11-21T22:58:26.312Z"
  },
  {
    "id": "4",
    "name": "Bishop Michael Kyazze",
    "title": "Lead Pastor, Omega Healing Centre, Namasuba, Uganda",
    "quote": "Rev. John William Kasirye extends a refreshing and urgent call to the Body of Christ—a divine reset for those weary of routine and bound by tradition. Beyond Church Walls reminds us that the world is our true diocese and the marketplace our mission field. This is a prophetic and empowering message, stirring believers to carry the Gospel into every sphere of influence with renewed passion and purpose.",
    "type": "pastoral",
    "approved": true,
    "createdAt": "2025-11-21T22:58:26.312Z"
  },
  {
    "id": "5",
    "name": "Pastor Paul Kinatama",
    "title": "General Overseer, Full Gospel Churches of Uganda",
    "quote": "I have known Rev. John William Kasirye since he first joined Makerere Full Gospel Church over four decades ago. His walk with God has always carried a prophetic edge—and this book is no exception. Beyond Church Walls is a must-read, a must-act message for our time, and a must-have on every believer's library shelf. It calls every believer to rise, reclaim the workplace, and reveal God's Kingdom in every sphere of life.",
    "type": "pastoral",
    "approved": true,
    "createdAt": "2025-11-21T22:58:26.312Z"
  }
]