{
  "1": {
    "title": "Rediscovering God's Design for Work",
    "theme": "Understanding work as worship - Work began in Eden as sacred service (avodah)",
    "keyScripture": "Genesis 2:15 - \"Yahweh God took the man, and put him into the garden of Eden to cultivate and keep it.\"",
    "learningObjective": "Understand that work was God's idea and remains part of His plan for worship",
    "startDate": "2025-11-23",
    "endDate": "2025-11-29",
    "questions": {
      "Worship": [
        {
          "id": "w1-1",
          "question": "This week, I intentionally began my workday with prayer or reflection on God's presence, recognizing that God 'put' me in my current position.",
          "dimension": "Worship"
        },
        {
          "id": "w1-2",
          "question": "I saw my work tasks as acts of worship and service to God, understanding that work existed before the Fall and is part of God's design.",
          "dimension": "Worship"
        },
        {
          "id": "w1-3",
          "question": "I maintained awareness of God's presence throughout my workday, viewing my workplace as a sacred space where God is present.",
          "dimension": "Worship"
        },
        {
          "id": "w1-4",
          "question": "I dedicated my work efforts this week to God's glory, recognizing that my work is part of God's plan for worship.",
          "dimension": "Worship"
        },
        {
          "id": "w1-5",
          "question": "I viewed my desk, classroom, or tools as an altar - a place where I can worship God through my work.",
          "dimension": "Worship"
        }
      ],
      "Integrity": [
        {
          "id": "i1-1",
          "question": "I took responsibility and stewardship seriously in my work, understanding the 'tend' and 'keep' aspects of my role.",
          "dimension": "Integrity"
        },
        {
          "id": "i1-2",
          "question": "I was honest and transparent in all my professional interactions, recognizing that my work reflects God's character.",
          "dimension": "Integrity"
        },
        {
          "id": "i1-3",
          "question": "I kept my commitments and followed through on promises, understanding that work involves responsibility and stewardship.",
          "dimension": "Integrity"
        },
        {
          "id": "i1-4",
          "question": "I actively cultivated and improved my work environment, living out the 'tend' aspect of work (to cultivate, develop, and improve).",
          "dimension": "Integrity"
        },
        {
          "id": "i1-5",
          "question": "I guarded and protected what was entrusted to me, living out the 'keep' aspect of work (to guard, protect, preserve) in my spiritual and moral responsibilities.",
          "dimension": "Integrity"
        }
      ],
      "Service": [
        {
          "id": "s1-1",
          "question": "I actively looked for opportunities to help and serve my colleagues, recognizing that work is meant to serve others.",
          "dimension": "Service"
        },
        {
          "id": "s1-2",
          "question": "I served others with humility, without seeking recognition, understanding that work is sacred service (avodah).",
          "dimension": "Service"
        },
        {
          "id": "s1-3",
          "question": "I showed compassion and empathy toward those I work with, reflecting God's heart for people in my workplace.",
          "dimension": "Service"
        }
      ],
      "Excellence": [
        {
          "id": "e1-1",
          "question": "I pursued quality and excellence in all my work tasks, understanding that work is part of God's good design.",
          "dimension": "Excellence"
        },
        {
          "id": "e1-2",
          "question": "I worked diligently and gave my best effort, recognizing that work is not a curse but part of God's original plan.",
          "dimension": "Excellence"
        },
        {
          "id": "e1-1763764327624",
          "question": "I continuously sought to grow and improve, cultivating my work environment as God called Adam to cultivate the garden.",
          "dimension": "Excellence"
        }
      ]
    },
    "studyQuestions": [
      {
        "id": "sq1-1",
        "question": "What does it mean that God 'put' Adam in the garden? What does this reveal about God's role in assigning work and purpose?"
      },
      {
        "id": "sq1-2",
        "question": "The words 'tend' and 'keep' imply responsibility and stewardship. How do these two actions shape our understanding of the purpose of work?"
      },
      {
        "id": "sq1-3",
        "question": "Work existed before the Fall. How does this truth challenge the belief that work is a curse or a punishment?"
      },
      {
        "id": "sq1-4",
        "question": "'Tend' means to cultivate, develop, and improve. How does God call you to cultivate the environment where He has placed you today?"
      },
      {
        "id": "sq1-5",
        "question": "'Keep' means to guard, protect, preserve. What spiritual or moral responsibilities come with your work, position, or influence?"
      }
    ],
    "reflectionQuestions": [
      {
        "id": "rq1-1",
        "question": "How does knowing God worked before creating man reshape your view of work?"
      },
      {
        "id": "rq1-1763761846511",
        "question": "What would change if you saw your desk, classroom, or tools as an altar?"
      }
    ],
    "updatedAt": "2025-11-21T22:32:13.969Z"
  },
  "2": {
    "title": "Tearing Down the Sacred–Secular Divide",
    "theme": "Expose and dismantle the false separation between 'spiritual' and 'ordinary' work",
    "keyScripture": "Romans 12:2 - \"Don’t be conformed to this world, but be transformed by the renewing of your mind, so that you may prove what is the good, well-pleasing, and perfect will of God.\"",
    "learningObjective": "True discipleship integrates faith into every sphere of life. Every believer is a full-time minister in their God-given field.",
    "startDate": "2025-11-30",
    "endDate": "2025-12-06",
    "questions": {
      "Worship": [
        {
          "id": "w2-1",
          "question": "I maintained a worshipful attitude in my work, refusing to separate 'church life' from 'work life'.",
          "dimension": "Worship"
        },
        {
          "id": "w2-2",
          "question": "I saw my work as an act of worship throughout the week, understanding that every believer is a full-time minister.",
          "dimension": "Worship"
        },
        {
          "id": "w2-3",
          "question": "I integrated my faith naturally into my workplace, living out the truth that there is no sacred-secular divide.",
          "dimension": "Worship"
        }
      ],
      "Integrity": [
        {
          "id": "i2-1",
          "question": "I refused to conform to worldly patterns in my workplace, choosing transformation over conformity.",
          "dimension": "Integrity"
        },
        {
          "id": "i2-2",
          "question": "I maintained moral consistency between my church life and work life, living as an integrated believer.",
          "dimension": "Integrity"
        },
        {
          "id": "i2-3",
          "question": "I was honest about my faith in appropriate ways at work, bridging the gap between my spiritual and professional life.",
          "dimension": "Integrity"
        },
        {
          "id": "i2-4",
          "question": "I took steps this week to bridge the divide between my faith and work, living as a full-time minister in my field.",
          "dimension": "Integrity"
        }
      ],
      "Service": [
        {
          "id": "s2-1",
          "question": "I served others at work with the same heart I serve at church, understanding that all work is ministry.",
          "dimension": "Service"
        },
        {
          "id": "s2-2",
          "question": "I looked for opportunities to demonstrate Christ's love in my workplace, living out integrated discipleship.",
          "dimension": "Service"
        },
        {
          "id": "s2-3",
          "question": "I showed compassion and empathy at work, recognizing that my workplace is part of my mission field.",
          "dimension": "Service"
        }
      ],
      "Excellence": [
        {
          "id": "e2-1",
          "question": "I pursued excellence in my work as an act of worship, understanding that transformation starts with renewing my mind.",
          "dimension": "Excellence"
        },
        {
          "id": "e2-2",
          "question": "I worked diligently, recognizing that my work is part of testing and approving God's will in my life.",
          "dimension": "Excellence"
        },
        {
          "id": "e2-3",
          "question": "I continuously sought to grow, allowing my mind to be renewed so I could discern God's good, pleasing, and perfect will.",
          "dimension": "Excellence"
        },
        {
          "id": "e2-4",
          "question": "I gave my best effort, working as unto the Lord, not conforming to the pattern of this world.",
          "dimension": "Excellence"
        }
      ]
    },
    "studyQuestions": [
      {
        "id": "sq2-1",
        "question": "What does 'do not be conformed to this world' mean?"
      },
      {
        "id": "sq2-2",
        "question": "What is the difference between conforming and transforming?"
      },
      {
        "id": "sq2-3",
        "question": "What does 'renewing of your mind' involve?"
      },
      {
        "id": "sq2-4",
        "question": "Why is the mind the starting point for transformation?"
      },
      {
        "id": "sq2-5",
        "question": "How does a renewed mind affect your daily life?"
      }
    ],
    "reflectionQuestions": [
      {
        "id": "rq2-1",
        "question": "When do you tend to divide 'church life' from 'work life'?"
      },
      {
        "id": "rq2-2",
        "question": "What steps can you take this week to bridge them?"
      }
    ],
    "completionMessage": {
      "title": "Congratulations!",
      "message": "You've completed this week's study! Keep up the great work as you continue to integrate faith into your daily work."
    },
    "updatedAt": "2025-11-21T23:45:45.491Z"
  }
}